<?php
$homeHeaderTXT = 'Карты';
$showMapsTogglerTXT = "'Все карты','Избранные карты'";
$dashboardHeaderTXT = 'Скорость и направление';
$dashboardSpeedTXT = 'Скорость';
$dashboardSpeedMesTXT = 'км/ч';
$dashboardDepthMesTXT = 'Глубина';
$dashboardMeterMesTXT = 'м.';
$dashboardKiloMeterMesTXT = 'км.';
$dashboardCourseTXT = "Путевой угол";
$dashboardCourseAltTXT = "Course over groung";
$dashboardHeadingTXT = 'Истинный курс';
$dashboardHeadingAltTXT = 'Heading';
$dashboardMHeadingTXT = "Магнитный курс";
$dashboardMHeadingAltTXT = "Magnetic heading";
$dashboardPosTXT = 'Местоположение';
$dashboardPosAltTXT = 'Latitude &nbsp; Longitude';
$dashboardSpeedZoomTXT = 'Вектор скорости - расстояние за';
$dashboardSpeedZoomMesTXT = 'минут';

$tracksHeaderTXT = 'Пути';
$loggingTXT = 'Запись пути';

$measureHeaderTXT = 'Маршрут';
$routeControlsBeginTXT = 'Начать';
$routeControlsContinueTXT = 'Продолжить';
$routeControlsClearTXT = 'Стереть';
$routePosTXT = "Широта &nbsp; Долгота";
$routeSaveTXT = 'Название';
$goToPositionTXT = 'Переместить карту в';
$routeSaveTitle = 'Сохранить маршрут на сервере';
$routeSaveDescrTXT = 'Описание файла';
$editableObjectDescrTXT = 'Описание объекта';

$routesHeaderTXT = 'Места и маршруты';

$coverTXT = 'Покрытие масштабом';
$downloadHeaderTXT = 'Загрузки';
$downloadZoomTXT = 'Масштаб';
$downloadJobListTXT = 'Поставлены загрузки';
$downloadLoaderIndicatorOnTXT = 'Загрузчик работает';
$downloadLoaderIndicatorOffTXT = 'Загрузчик не работает. Нажмите, чтобы запустить';

$settingsHeaderTXT = 'Параметры';
$settingsCursorTXT = 'Следование <br>за курсором';
$settingsTrackTXT = 'Текущй трек <br>всегда показывается';
$settingsRoutesAlwaysTXT = 'Выбранные маршруты <br>всегда показываются';
$settingsdistCirclesTXT = 'Показывать окружности дистанции';
$DisplayAIS_TXT = 'Отображение AIS';
$minWATCHintervalTXT = 'Обновлять положение не чаще, чем раз в, сек. ';

$integerTXT = 'Целое число';
$realTXT = 'Дробное число';
$clearTXT = 'Очистить';
$okTXT = 'Создать!';
$latTXT = 'Ш';
$longTXT = 'Д';
$completeTXT = 'выполнено';
$copyToClipboardMessageOkTXT = 'Копирование в буфер обмена выполнено ';
$copyToClipboardMessageBadTXT = 'Копирование в буфер обмена не удалось ';

$AISstatusTXT = array(
0=>'Двигаюсь под мотором',
1=>'На якоре',
2=>'Без экипажа',
3=>'Ограничен в манёвре',
4=>'Ограничен осадкой',
5=>'Ошвартован',
6=>'На мели',
7=>'Занят ловлей рыбы',
8=>'Двигаюсь под парусом',
11=>'Тяну буксир',
12=>'Толкаю состав или буксирую под бортом',
15=>''
);
$AISshipTypeTXT = array(
0=>'',
20=>'экраноплан',
21=>'экраноплан, опасный груз A',
22=>'экраноплан, опасный груз B',
23=>'экраноплан, опасный груз C',
24=>'экраноплан, опасный груз D',
25=>'экраноплан',
26=>'экраноплан',
27=>'экраноплан',
28=>'экраноплан',
29=>'спасательный самолёт',
30=>'рыболовное судно',
31=>'буксирование',
32=>'буксирование состава более 200 м.',
33=>'землечерпалка',
34=>'водолазный бот',
35=>'военное судно',
36=>'парусное судно',
37=>'прогулочное судно',
40=>'скоростное судно',
41=>'скоростное судно, опасный груз A',
42=>'скоростное судно, опасный груз B',
43=>'скоростное судно, опасный груз C',
44=>'скоростное судно, опасный груз D',
45=>'скоростное судно',
46=>'скоростное судно',
47=>'скоростное судно',
48=>'скоростное судно',
49=>'скоростное судно',
50=>'лоцман',
51=>'спасательное судно',
52=>'буксир',
53=>'портовое судно',
54=>'очистное судно',
55=>'патруль',
56=>'местный тип',
57=>'местный тип',
58=>'медицинский транспорт',
59=>'специальное судно',
60=>'пассажирское судно',
61=>'пассажирское судно, опасный груз A',
62=>'пассажирское судно, опасный груз B',
63=>'пассажирское судно, опасный груз C',
64=>'пассажирское судно, опасный груз D',
65=>'пассажирское судно',
66=>'пассажирское судно',
67=>'пассажирское судно',
68=>'пассажирское судно',
69=>'пассажирское судно',
70=>'грузовое судно',
71=>'грузовое судно, опасный груз A',
72=>'грузовое судно, опасный груз B',
73=>'грузовое судно, опасный груз C',
74=>'грузовое судно, опасный груз D',
75=>'грузовое судно',
76=>'грузовое судно',
77=>'грузовое судно',
78=>'грузовое судно',
79=>'грузовое судно',
80=>'танкер',
81=>'танкер, опасный груз A',
82=>'танкер, опасный груз B',
83=>'танкер, опасный груз C',
84=>'танкер, опасный груз D',
85=>'танкер',
86=>'танкер',
87=>'танкер',
88=>'танкер',
89=>'танкер',
90=>'особое судно',
91=>'особое судно, опасный груз A',
92=>'особое судно, опасный груз B',
93=>'особое судно, опасный груз C',
94=>'особое судно, опасный груз D',
95=>'особое судно',
96=>'особое судно',
97=>'особое судно',
98=>'особое судно',
99=>'особое судно',
);

$mobTXT = "Человек за бортом!";
$addMarkerTXT = "Ещё маркер";
$bearingTXT = "Абсолютный азимут";
$altBearingTXT = "bearing";
$distanceTXT = 'Расстояние';
$altDistanceTXT = 'distance';
$removeMarkerTXT = "Убрать маркер";
$cancelMOBTXT = "Завершить";
$relBearingTXT = "'прямо по курсу',
'справа впереди',
'справа по борту',	
'справа сзади',
'сзади по корме',
'слева сзади',
'слева по борту',	
'слева впереди'";
?>
